_posts/2022-02-04-boj-14231.html
---
title: BOJ 14231 박스 포장
tags: DP
---

<div id="outline-container-orgec7fd51" class="outline-2">
<h2 id="orgec7fd51">BOJ 14231 박스 포장</h2>
<div class="outline-text-2" id="text-orgec7fd51">
<ul class="org-ul">
<li>dp로 LIS풀기</li>
</ul>
</div>
</div>

<div id="outline-container-org878ef3c" class="outline-2">
<h2 id="org878ef3c">접근하기</h2>
<div class="outline-text-2" id="text-org878ef3c">
<pre class="example">
i앞에 있는 박스가 뒤에 있는 박스보다 작아야지만, 뒤에 있는 박스에 넣을 수 있다.

LIS(N) - N까지의 값이 증가하는 최대 수열

a[j] &lt; a[i] &amp;&amp; dp[i] &lt; dp[j] + 1
  =&gt; dp[i] = dp[j] + 1
</pre>
</div>
</div>

<div id="outline-container-org7f13ba3" class="outline-2">
<h2 id="org7f13ba3">코드 - DP로 풀이</h2>
<div class="outline-text-2" id="text-org7f13ba3">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">FASTIO</span> <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>); cin.tie(<span style="color: #8ae234;">NULL</span>);
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">INF</span> 1e9

<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">ARRSIZE</span> 5050

<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">a</span>[ARRSIZE];
<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">dp</span>[ARRSIZE];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234; font-weight: bold;">FASTIO</span>
    <span style="color: #ff6347;">cin</span> &gt;&gt; N;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        cin &gt;&gt; a[i];
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        dp[i] = 1;
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=1;j&lt;=i;j++) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (a[i] &gt; a[j] &amp;&amp; dp[i] &lt; dp[j] + 1) {
                dp[i] = dp[j] + 1;
            }
        }
    }
    <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">ans</span> = dp[1];
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        ans = max(ans, dp[i]);
    }

    cout &lt;&lt; ans &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a26c50" class="outline-2">
<h2 id="org8a26c50"><span class="todo TODO">TODO</span> 코드 - lower_bound로 풀이</h2>
</div>

<div id="outline-container-org7a0d07f" class="outline-2">
<h2 id="org7a0d07f">문제 링크</h2>
<div class="outline-text-2" id="text-org7a0d07f">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/14231">https://www.acmicpc.net/problem/14231</a></li>
</ul>
</div>
</div>
